import React, { Component } from 'react';
import { connect } from 'react-redux';
import {
  DetailWarpper, Header, Content,
} from './style';

class Detail extends Component {
  render() {
    return (
      <DetailWarpper>
        <Header>惊悚|140微小说</Header>
        <Content>
          <img />
          <p>
          “和亲政策”历来以久，早在周襄王时期就有了，当时周襄王就娶了狄女为王后，然后一起讨伐郑，此后汉唐元明清，都有和亲政策。和亲是历代统治者为了稳固统治的一种常用的手段，有利于各民族团结，有利于经济文化交流，有一定的积极作用。汉朝当然也有和亲政策，但是也出了一件很奇葩的事情，就是去波斯和亲的公主在路上生子了，他们也干脆不走了，就在这个地方建了个国家朅盘陀。我们一起去汉朝看看这次奇葩的和亲吧。





公主出嫁的途中怀孕。汉朝和历代朝代一样，也经常和匈奴、西域进行和亲，当时西亚的波斯国就派了使者来到汉朝要求和亲，汉朝也不好拒绝，就答应了。他们舍不得真正的公主嫁这么远，就选了一个宫女加封为公主，然后风风光光让她去和亲。两个国家路途遥远，可是屋漏偏逢连夜雨，等和亲团好不容易走到达葱岭，就快要进入波斯境地的时候，又遇上了匪乱。他们修了城堡让公主住下，然后开始了苦战，打了三个月，终于平息了战乱，应该接着上路了吧。这个时候却传出来一个震惊所有人的消息：这个和亲的公主居然怀孕了。





这个孩子是“汉日天种”。勿相尤也，乃神会耳。每日正中有一丈夫，从日轮中乘马会此。《大唐西域记》就在所有人困惑的时候，公主的侍女走了出来，解释说公主在城堡的时候，一个骑着金马的王子从太阳中降落到山顶和公主幽会了，说这个孩子是“汉日天种”。这样奇葩的解释大家内心肯定是不会信的，但是他们也左右为难，去西亚波斯吧，性命估计都难保，回汉朝吧，也要被讥讽和责罚。

作者：湘西小木鱼
链接：https://www.jianshu.com/p/47c5d401a265
來源：简书
简书著作权归作者所有，任何形式的转载都请联系作者获得授权并注明出处。
          </p>
        </Content>
      </DetailWarpper>
    );
  }
}
// const Detail = () => <div>Detail</div>;
export default Detail;
